CREATE OR REPLACE VIEW sttgaz.dm_isc_sales_v AS
WITH
    dds_data AS(
        SELECT
            d."Дивизион",
            d."Название" AS 'Дилер',
			s."Внутренний код", 
            s."Территория продаж",
			s."Направление реализации с учетом УКП",
            DATE_TRUNC('MONTH', "Дата продажи")::date AS "Период",
            SUM(s."Продано в розницу") AS "Продано в розницу",
            SUM(s."Продано физ лицам") AS "Продано физ лицам",
            SUM(s."Остатки на НП в пути") AS "Остатки на НП в пути",
            SUM(s."Остатки на КП в пути") AS "Остатки на КП в пути"
        FROM sttgaz.dds_isc_sales       AS s
        LEFT JOIN sttgaz.dds_isc_dealer AS d
            ON s."Дилер ID" = d.id
        LEFT JOIN sttgaz.dds_isc_buyer  AS b 
            ON s."Покупатель ID" = b.id
        GROUP BY 
        	d."Дивизион",
            d."Название",
			s."Внутренний код", 
            s."Территория продаж",
			s."Направление реализации с учетом УКП",
            DATE_TRUNC('MONTH', "Дата продажи")::date
	),
	sq1 AS(
		SELECT DISTINCT
			"Дивизион",
			"Дилер",
			"Территория продаж",
			"Внутренний код",
			"Направление реализации с учетом УКП"
		FROM dds_data
	),
	sq2 AS(
		SELECT DISTINCT DATE_TRUNC('MONTH', "Период")::date AS "Период"
		FROM dds_data	
	),
	sq3 AS(
		SELECT *
		FROM sq1
		CROSS JOIN sq2
	),
	sq4 AS(
		SELECT 
			DATE_TRUNC('MONTH', sq3."Период")::date 								AS "Месяц",
			sq3."Дивизион",
			sq3."Дилер",
			sq3."Территория продаж",
			sq3."Внутренний код",
			sq3."Направление реализации с учетом УКП",
			s."Продано в розницу" 												AS "Продажи в розницу",
			s."Продано физ лицам"												AS "Продажи физ лицам",
			s."Остатки на НП в пути" 										    AS "Остатки на НП",
			s."Остатки на КП в пути"											AS "Остатки на КП"
		FROM sq3
		LEFT JOIN dds_data AS s
			ON DATE_TRUNC('MONTH', sq3."Период") = DATE_TRUNC('MONTH', s."Период") 
			AND HASH(sq3."Дилер", sq3."Дивизион", sq3."Территория продаж", sq3."Внутренний код", sq3."Направление реализации с учетом УКП")
				= HASH(s."Дилер", s."Дивизион", s."Территория продаж", s."Внутренний код",s."Направление реализации с учетом УКП") 
	)
SELECT
	*,
	LAG("Продажи в розницу") OVER (
		PARTITION BY "Дивизион", "Дилер", "Территория продаж", "Внутренний код", "Направление реализации с учетом УКП" ORDER BY "Месяц"
	) 		    																								AS "Продажи в розницу за прошлый месяц",
	LAG("Продажи физ лицам") OVER (
		PARTITION BY "Дивизион", "Дилер", "Территория продаж", "Внутренний код", "Направление реализации с учетом УКП" ORDER BY "Месяц"
	) 		    																								AS "Продажи физ лицам за прошлый месяц",
	LAG("Продажи в розницу", 12) OVER (
		PARTITION BY "Дивизион", "Дилер", "Территория продаж", "Внутренний код", "Направление реализации с учетом УКП" ORDER BY "Месяц"
	) 																											AS "Продажи в розницу за прошлый год",
	LAG("Продажи физ лицам", 12) OVER (
		PARTITION BY "Дивизион", "Дилер", "Территория продаж", "Внутренний код", "Направление реализации с учетом УКП" ORDER BY "Месяц"
	) 																											AS "Продажи физ лицам за прошлый год"
FROM sq4;

GRANT SELECT ON TABLE sttgaz.dm_isc_sales_v TO PowerBI_Integration WITH GRANT OPTION;